## üçÅ PANDAS(Python For Data Analysis)

- Pandas is a popular open-source software library for the Python programming language, specifically designed for data manipulation and analysis.

### ‚òòÔ∏è Key Features of Pandas

-	Fast and efficient DataFrame object with default and customized indexing.
-	Tools for loading data into in-memory data objects from different file formats.
-	Data alignment and integrated handling of missing data.
-	Reshaping and pivoting of date sets.
-	Label-based slicing, indexing and subsetting of large data sets.
-	Columns from a data structure can be deleted or inserted.
-	Group by data for aggregation and transformations.
-	High performance merging and joining of data.
-	Time Series functionality.

### ‚òòÔ∏è Difference b/w Pandas and NumPY

- Numpy works with arrays while Pandas works with data frames and series.
- Numpy is best suited for working homogenous data while Pandas is best suited for working with tabular and heterogeneous i.e. different kind of data.

### üéç Pandas generally provide two data structure for manipulating data, They are:
                               ‚Ä¢	Series

                               ‚Ä¢	DataFrame

In [53]:
import pandas as pd
import numpy as np

### ‚öúÔ∏è SERIES CREATION

- pd.Series(List)

In [3]:
pd.Series(['Tom', 'Zara', 'Nora', 'Jerry'])

0      Tom
1     Zara
2     Nora
3    Jerry
dtype: object

__________________

#### üî∞ INDEXING OF SERIES

In [7]:
pd.Series(['Tom', 'Zara', 'Nora', 'Jerry'], index = ['EMP1', 'EMP2', 'EMP3', 'EMP4'])

EMP1      Tom
EMP2     Zara
EMP3     Nora
EMP4    Jerry
dtype: object

________________

#### üî∞ SERIES OF DICTIONARY

In [8]:
details = { 'Rahul': 45, 'John':48, 'Ram':33, 'Sam':36}
details

{'Rahul': 45, 'John': 48, 'Ram': 33, 'Sam': 36}

In [9]:
type(details)

dict

In [10]:
pd.Series(details)

Rahul    45
John     48
Ram      33
Sam      36
dtype: int64

______________

#### üî∞ FILTERING BY INDEX

In [13]:
pd.Series(details , index = ['Rahul','Sam'])

Rahul    Rahul
Sam      Rahul
dtype: object

In [15]:
b = pd.Series(details , index = ['Rahul','Sam'])
b

Rahul    Rahul
Sam      Rahul
dtype: object

____________

#### üî∞ CREATING A SERIES FROM SCALAR

In [16]:
s = pd.Series(5, index=[1,2,3,4])
s

1    5
2    5
3    5
4    5
dtype: int64

_______________

#### üî∞ RETRIVING DATA FROM SERIES

In [17]:
details = { 'Rahul': 45, 'John':48, 'Ram':33, 'Sam':36}
details

{'Rahul': 45, 'John': 48, 'Ram': 33, 'Sam': 36}

In [18]:
details['Rahul']

45

_______________________

### üî∞ iloc - Integer Location

- Used If index is an integer

In [24]:
a = pd.Series(['Tom', 'Zara', 'Nora', 'Jerry'])
a

0      Tom
1     Zara
2     Nora
3    Jerry
dtype: object

In [25]:
a.iloc[0]

'Tom'

_________________

### üî∞ loc - Location

- Used If Index is Text

In [31]:
b = pd.Series(['Tom', 'Zara', 'Nora', 'Jerry'], index = ['EMP1', 'EMP2', 'EMP3', 'EMP4'])
b

EMP1      Tom
EMP2     Zara
EMP3     Nora
EMP4    Jerry
dtype: object

In [33]:
b.loc['EMP1']

'Tom'

_____________________

_______________

### ‚öúÔ∏è DATA FRAME

#### üî∞ LIST

In [36]:
students = [['Tom', 18, 77], ['James', 17, 81], ['Zara', 19, 67], ['Nora', 16, 56]]
students

[['Tom', 18, 77], ['James', 17, 81], ['Zara', 19, 67], ['Nora', 16, 56]]

In [41]:
pd.DataFrame(students, index = ['Stud1', 'Stud2', 'Stud3', 'Stud4'], columns = ['Name', 'Age', 'Marks'])

        Name  Age  Marks
Stud1    Tom   18     77
Stud2  James   17     81
Stud3   Zara   19     67
Stud4   Nora   16     56

_____

#### üî∞ DICTIONARY

In [48]:
vehicle_details ={ 'Brand' : ['BMW', 'Toyota', 'Infinity', 'Land Rover'], 
                  'Model' :['7 Series', 'Land Crusier', 'QX60', 'Defender'],
                  'Color' : ['Black', 'White', 'Blue', 'Green'],
                  }

In [49]:
pd.DataFrame(vehicle_details, index = ['Car1', 'Car2', 'Car3', 'Car4'])

           Brand         Model  Color
Car1         BMW      7 Series  Black
Car2      Toyota  Land Crusier  White
Car3    Infinity          QX60   Blue
Car4  Land Rover      Defender  Green

______________

#### üî∞ DATAFRAMES FROM SERIES

In [ ]:
d ={'one':pd.Series([1,2,3], index=['a','b','c']),
'two':pd.Series([1,2,3,4], index=['a','b','c','d'])}

In [52]:
pd.DataFrame(d)

   one  two
a  1.0    1
b  2.0    2
c  3.0    3
d  NaN    4

________________________

____________________

In [54]:
Employees = { 'Employee_Name': ['Jack', 'Jim', 'James', 'John'], 
                    'Employee_Experience' : [2, 4, 3, 5],
                    'Employee_Salary' : [20000, 25000, 30000, 35000]}

In [63]:
employee_details = pd.DataFrame(Employees)
employee_details

  Employee_Name  Employee_Experience  Employee_Salary
0          Jack                    2            20000
1           Jim                    4            25000
2         James                    3            30000
3          John                    5            35000

### ‚öúÔ∏è FILTERATION

#### üî∞ FILTERING COLUMNS

In [58]:
employee_details['Employee_Name']

0     Jack
1      Jim
2    James
3     John
Name: Employee_Name, dtype: object

In [64]:
type(employee_details)

pandas.core.frame.DataFrame

#### üî∞ FILTERING MULTIPLE COLUMNS USING LIST

In [68]:
employee_details[['Employee_Name', 'Employee_Salary']]

  Employee_Name  Employee_Salary
0          Jack            20000
1           Jim            25000
2         James            30000
3          John            35000

________________

#### üî∞ FILTERING USING LOC & ILOC

In [69]:
employee_details.iloc[1]

Employee_Name            Jim
Employee_Experience        4
Employee_Salary        25000
Name: 1, dtype: object

In [72]:
employee_details[1:3]

  Employee_Name  Employee_Experience  Employee_Salary
1           Jim                    4            25000
2         James                    3            30000

_________________________

### ‚öúÔ∏è ADDING COLUMNS TO EXISTING COLUMNS

In [76]:
employee_details['Employee_Department'] = ['IT', 'Finance', 'HR', 'Sales']

In [77]:
employee_details

  Employee_Name  Employee_Experience  Employee_Salary Employee_Department
0          Jack                    2            20000                  IT
1           Jim                    4            25000             Finance
2         James                    3            30000                  HR
3          John                    5            35000               Sales

In [79]:
employee_details['Employee_Department'] = ['Sales'] * 4

In [80]:
employee_details

  Employee_Name  Employee_Experience  Employee_Salary Employee_Department
0          Jack                    2            20000               Sales
1           Jim                    4            25000               Sales
2         James                    3            30000               Sales
3          John                    5            35000               Sales

_______________

_____________________

### ‚öúÔ∏è DELETING A ROW OR COLUMN

In [81]:
employee_details

  Employee_Name  Employee_Experience  Employee_Salary Employee_Department
0          Jack                    2            20000               Sales
1           Jim                    4            25000               Sales
2         James                    3            30000               Sales
3          John                    5            35000               Sales

_____________________

#### üî∞ DELETING A COLUMN

- dataframename.drop()   - used to delete Rows but NOT Columns
- But the Column can be Deleted using 'axis = 1'
- axis = 0 : means rows
- axis = 1 : means columns

In [83]:
employee_details.drop('Employee_Department', axis = 1)

  Employee_Name  Employee_Experience  Employee_Salary
0          Jack                    2            20000
1           Jim                    4            25000
2         James                    3            30000
3          John                    5            35000

__________________

#### üî∞ DELETING A ROWS

- dataframe_name.drop(index_number, axis = 0)

In [84]:
employee_details

  Employee_Name  Employee_Experience  Employee_Salary Employee_Department
0          Jack                    2            20000               Sales
1           Jim                    4            25000               Sales
2         James                    3            30000               Sales
3          John                    5            35000               Sales

In [89]:
employee_details.drop(3, axis = 0)

  Employee_Name  Employee_Experience  Employee_Salary Employee_Department
0          Jack                    2            20000               Sales
1           Jim                    4            25000               Sales
2         James                    3            30000               Sales

- Rows and Columns deleted by drop method is not permenent with this method.
- But Rows and Columns can be Deleted Permently by using 'inplace=True'.

In [ ]:
employee_details=employee_details.drop('Employee_Department', axis=1, inplace=True)

In [ ]:
employee_details = employee_details.drop(3, inplace = True)

_____________________

In [20]:
Employees = { 'Employee_Name': ['Jack', 'Jim', 'James', 'John'], 
                    'Employee_Experience' : [2, 4, 3, 5],
                    'Employee_Salary' : [20000, 25000, 30000, 35000]}

In [28]:
df = pd.DataFrame(Employees)
df

  Employee_Name  Employee_Experience  Employee_Salary
0          Jack                    2            20000
1           Jim                    4            25000
2         James                    3            30000
3          John                    5            35000

#### üî∞ DELETING MORE THAN ONE COLUMNS

#### ‚ö°Ô∏è ANOTHER APPROCH OF PERMENENTLY DELETING COLUMNS

In [30]:
df = df.drop(['Employee_Salary', 'Employee_Experience'], axis=1)
df

  Employee_Name
0          Jack
1           Jim
2         James
3          John

_______________

### ‚öúÔ∏è READING FILE

#### üî∞ READING CSV FILE

In [31]:
df = pd.read_csv(r'C:\Users\Surface Pro\Desktop\ENTRI APP\phython\Ivin notes\dm_office_sales.csv')    # or using double slash

_____________

#### üî∞ FOR LOADING FIRST 5 ROWS

In [32]:
df.head()

,division,level of education,training level,work experience,salary,sales
0,printers,some college,2,6,91684,372302
1,printers,associate's degree,2,10,119679,495660
2,peripherals,high school,0,9,82045,320453
3,office supplies,associate's degree,2,5,92949,377148
4,office supplies,high school,1,5,71280,312802

#### üî∞ FOR LOADING LAST 5 ROWS

In [33]:
df.tail()

,division,level of education,training level,work experience,salary,sales
995,computer hardware,associate's degree,1,1,70083,177953
996,computer software,associate's degree,1,0,68648,103703
997,peripherals,associate's degree,2,8,108354,450011
998,peripherals,associate's degree,2,3,79035,330354
999,computer hardware,some college,0,9,108444,364436

#### üî∞ iloc FOR LOADING DESIRED ROWS BY SPECIFYING THE ROW INDEX

In [36]:
df.iloc[4:8]

,division,level of education,training level,work experience,salary,sales
4,office supplies,high school,1,5,71280,312802
5,computer hardware,some college,0,10,102401,366451
6,peripherals,associate's degree,0,5,77548,230899
7,office supplies,some college,0,6,81966,265915

#### üî∞ FOR LOADING THE COLUMN NAMES

In [37]:
df.columns

Index(['division', 'level of education', 'training level', 'work experience',
       'salary', 'sales'],
      dtype='object')

#### üî∞ TO GET AN OVERALL DETAILED INFORMATION OF DATA SET

In [38]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 6 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   division            1000 non-null   object
 1   level of education  1000 non-null   object
 2   training level      1000 non-null   int64
 3   work experience     1000 non-null   int64
 4   salary              1000 non-null   int64
 5   sales               1000 non-null   int64
dtypes: int64(4), object(2)
memory usage: 47.0+ KB

#### üî∞ STATISTICAL SUMMARY OF NUMERICAL DATA

In [39]:
df.describe()

       training level  work experience         salary          sales
count     1000.000000       1000.00000    1000.000000    1000.000000
mean         1.262000          6.14200   90264.207000  339833.846000
std          0.925317          2.94797   17398.617174  108555.773316
min          0.000000          0.00000   41660.000000   53067.000000
25%          1.000000          4.00000   77584.000000  259257.500000
50%          1.000000          6.00000   89946.000000  338145.500000
75%          2.000000          8.00000  101834.250000  415210.250000
max          3.000000         16.00000  159148.000000  761477.000000

#### üî∞ STATISTICAL SUMMARY OF NON NUMERICAL COLUMNS

In [42]:
df.describe(include = object).T   # T for transponse

                   count unique                 top freq
division            1000      5     office supplies  252
level of education  1000      5  associate's degree  412

__________

#### üî∞ FIND MISSING VALUES

In [43]:
df.isnull

<bound method DataFrame.isnull of               division  level of education  training level  work experience  \
0             printers        some college               2                6
1             printers  associate's degree               2               10
2          peripherals         high school               0                9
3      office supplies  associate's degree               2                5
4      office supplies         high school               1                5
..                 ...                 ...             ...              ...
995  computer hardware  associate's degree               1                1
996  computer software  associate's degree               1                0
997        peripherals  associate's degree               2                8
998        peripherals  associate's degree               2                3
999  computer hardware        some college               0                9

     salary   sales
0     91684  372302
1    119679  495660
2     82045  320453
3     92949  377148
4     71280  312802
..      ...     ...
995   70083  177953
996   68648  103703
997  108354  450011
998   79035  330354
999  108444  364436

[1000 rows x 6 columns]>

- If null shows True else False

#### üî∞ FIND THE TOTAL SUM OF MISSING VALUE

In [46]:
df.isnull().sum()

division              0
level of education    0
training level        0
work experience       0
salary                0
sales                 0
dtype: int64

____________

### üî∞ HANDILING MISSING VALUES

- DROPNA()
- FILLNA()

#### üî∞ DELETING THE MISSING VALUES

In [48]:
df.dropna()     # drops na and nan
                # not a permenent operation

,division,level of education,training level,work experience,salary,sales
0,printers,some college,2,6,91684,372302
1,printers,associate's degree,2,10,119679,495660
2,peripherals,high school,0,9,82045,320453
3,office supplies,associate's degree,2,5,92949,377148
4,office supplies,high school,1,5,71280,312802
...,...,...,...,...,...,...
995,computer hardware,associate's degree,1,1,70083,177953
996,computer software,associate's degree,1,0,68648,103703
997,peripherals,associate's degree,2,8,108354,450011
998,peripherals,associate's degree,2,3,79035,330354
999,computer hardware,some college,0,9,108444,364436

#### üî∞ FOR PERMENENT DELETION - 2 METHODS

In [ ]:
df.dropna(inplace = True)    # or

In [ ]:
df = df.dropna()

#### üî∞ FOR FILLING VALUES WITH MISSING VALUES

- Values to be filled, should be provided inside the brackets.
- Since it is generic, it fills the Missing values through out the rows and columns.

In [49]:
df.fillna('value')

,division,level of education,training level,work experience,salary,sales
0,printers,some college,2,6,91684,372302
1,printers,associate's degree,2,10,119679,495660
2,peripherals,high school,0,9,82045,320453
3,office supplies,associate's degree,2,5,92949,377148
4,office supplies,high school,1,5,71280,312802
...,...,...,...,...,...,...
995,computer hardware,associate's degree,1,1,70083,177953
996,computer software,associate's degree,1,0,68648,103703
997,peripherals,associate's degree,2,8,108354,450011
998,peripherals,associate's degree,2,3,79035,330354
999,computer hardware,some college,0,9,108444,364436

#### üî∞ FOR FILLING VALUES TO SPECIFIC COLUMNS

In [51]:
df['division'].fillna('printers')

0               printers
1               printers
2            peripherals
3        office supplies
4        office supplies
             ...
995    computer hardware
996    computer software
997          peripherals
998          peripherals
999    computer hardware
Name: division, Length: 1000, dtype: object

In [54]:
np.mean(df['salary'])

90264.207

In [55]:
df['salary'].fillna(90264.20)

0       91684
1      119679
2       82045
3       92949
4       71280
        ...
995     70083
996     68648
997    108354
998     79035
999    108444
Name: salary, Length: 1000, dtype: int64

_________________

### ‚öúÔ∏è FINDING VALUE COUNTS OF CATEGORICAL COLUMN

In [56]:
df['division'].value_counts()

division
office supplies      252
printers             250
peripherals          243
computer hardware    159
computer software     96
Name: count, dtype: int64

________________________

#### ‚öúÔ∏è SUMMARIZING DATA BY  WITH CATEGORICAL COLUMN WITH GROUPBY AND AGGREGATION FUNCTION

- aggregation function: sum(), max(), min(), count(), describe() etc
- For mean(), it gives Type Error

In [59]:
df.groupby('level of education').max()

                    division  training level  work experience  salary   sales
level of education
associate's degree  printers               3               15  159148  761477
bachelor's degree   printers               3               14  131252  547429
high school         printers               3               14  128460  615221
master's degree     printers               3                8   96587  366637
some college        printers               3               16  143988  677672

In [63]:
df.groupby('level of education').sum()

,division,training level,work experience,salary,sales
level of education,,,,,
associate's degree,printersoffice suppliesperipheralsprinterscomp...,507,2599,38380441,141549223
bachelor's degree,printersoffice suppliescomputer softwareoffice...,106,490,8001370,27584129
high school,peripheralsoffice suppliesperipheralsperiphera...,149,634,9059834,36671585
master's degree,office suppliesprinterscomputer hardware,4,16,281154,986438
some college,printerscomputer hardwareoffice suppliesoffice...,496,2403,34541408,133042471

In [72]:
df.select_dtypes(include=object)

              division  level of education
0             printers        some college
1             printers  associate's degree
2          peripherals         high school
3      office supplies  associate's degree
4      office supplies         high school
..                 ...                 ...
995  computer hardware  associate's degree
996  computer software  associate's degree
997        peripherals  associate's degree
998        peripherals  associate's degree
999  computer hardware        some college

[1000 rows x 2 columns]

In [73]:
df.select_dtypes(exclude=object)

     training level  work experience  salary   sales
0                 2                6   91684  372302
1                 2               10  119679  495660
2                 0                9   82045  320453
3                 2                5   92949  377148
4                 1                5   71280  312802
..              ...              ...     ...     ...
995               1                1   70083  177953
996               1                0   68648  103703
997               2                8  108354  450011
998               2                3   79035  330354
999               0                9  108444  364436

[1000 rows x 4 columns]

#### üí† FOR GROUPING MEAN

In [68]:
numerical_df = df.select_dtypes(include = 'number')
numerical_df

     training level  work experience  salary   sales
0                 2                6   91684  372302
1                 2               10  119679  495660
2                 0                9   82045  320453
3                 2                5   92949  377148
4                 1                5   71280  312802
..              ...              ...     ...     ...
995               1                1   70083  177953
996               1                0   68648  103703
997               2                8  108354  450011
998               2                3   79035  330354
999               0                9  108444  364436

[1000 rows x 4 columns]

In [75]:
numerical_df.groupby('work experience').mean()

                 training level         salary          sales
work experience
0                      1.230769   58485.153846  146553.153846
1                      1.607143   67835.214286  214623.928571
2                      1.313725   68388.196078  214616.823529
3                      1.205128   73935.051282  240141.512821
4                      1.307692   81172.846154  281863.820513
5                      1.135338   84280.781955  300920.774436
6                      1.271318   89069.356589  335767.496124
7                      1.240000   93783.832000  361387.176000
8                      1.284314   99852.911765  394306.813725
9                      1.350649  104834.194805  432249.961039
10                     1.209677  109494.064516  450316.516129
11                     1.433333  115050.833333  494266.066667
12                     1.136364  119348.454545  516760.818182
13                     1.083333  123281.083333  535809.083333
14                     1.000000  123643.000000  559738.750000
15                     1.666667  144669.666667  655399.666667
16                     1.000000  138975.000000  595815.000000

_______________

### ‚öúÔ∏è COMBINING DATA FRAMES

- pd.concat() for combining data frames.

In [76]:
data_one = {'A':['A0', 'A1', 'A2', 'A3'], 'B':['B0','B1','B2','B3']}
data_two = {'C':['C0','C1','C2','C3'], 'D':['C0','C1','C2','C3']}

In [77]:
data_one

{'A': ['A0', 'A1', 'A2', 'A3'], 'B': ['B0', 'B1', 'B2', 'B3']}

In [78]:
data_two

{'C': ['C0', 'C1', 'C2', 'C3'], 'D': ['C0', 'C1', 'C2', 'C3']}

In [81]:
one = pd.DataFrame(data_one)
one

    A   B
0  A0  B0
1  A1  B1
2  A2  B2
3  A3  B3

In [82]:
two = pd.DataFrame(data_two)
two

    C   D
0  C0  C0
1  C1  C1
2  C2  C2
3  C3  C3

In [ ]:
### axis = 0 concatenate vertically

In [83]:
pd.concat([one, two], axis =0)

     A    B    C    D
0   A0   B0  NaN  NaN
1   A1   B1  NaN  NaN
2   A2   B2  NaN  NaN
3   A3   B3  NaN  NaN
0  NaN  NaN   C0   C0
1  NaN  NaN   C1   C1
2  NaN  NaN   C2   C2
3  NaN  NaN   C3   C3

In [84]:
pd.concat([one, two], axis =1)

    A   B   C   D
0  A0  B0  C0  C0
1  A1  B1  C1  C1
2  A2  B2  C2  C2
3  A3  B3  C3  C3

In [85]:
# updating column headings

In [99]:
two.columns

Index(['C', 'D'], dtype='object')

In [104]:
two.columns = one.columns

In [105]:
two.columns

Index(['A', 'B'], dtype='object')

In [106]:
one.columns

Index(['A', 'B'], dtype='object')

In [108]:
a = pd.concat([one,two], axis =0)

In [109]:
a

    A   B
0  A0  B0
1  A1  B1
2  A2  B2
3  A3  B3
0  C0  C0
1  C1  C1
2  C2  C2
3  C3  C3

In [110]:
# updating index

In [114]:
a.index = range(len(a))   # can be applied for large dataset

In [115]:
a

    A   B
0  A0  B0
1  A1  B1
2  A2  B2
3  A3  B3
4  C0  C0
5  C1  C1
6  C2  C2
7  C3  C3

__________________________________________

_______________________